export type RadioQuestion = {
  id: string;
  type: "radio";
  text: string;
  options: {
    label: string;
    value: number;
  }[];
};

export type ScaleQuestion = {
  id: string;
  type: "scale";
  text: string;
  min: number;
  max: number;
  step?: number;
};

export type NumberQuestion = {
  id: string;
  type: "number";
  text: string;
  min?: number;
  max?: number;
  placeholder?: string;
};

export type Question = RadioQuestion | ScaleQuestion | NumberQuestion;

export type Questionnaire = {
  title: string;
  subtitle?: string;
  description?: string;
  questions: Question[];
};

const commonTwoOptions = [
  { label: "بله", value: 0 },
  { label: "خیر ", value: 1 },
];
const commonForPatienthealth = [
  { label: "ابدا", value: 0 },
  { label: "چند روز ", value: 1 },
  { label: " بیش از نصف روزها ", value: 2 },
  { label: " تقریبا هر روز ", value: 3 },
];
const commonForPatienthealthPhysical = [
  { label: "اذیت نشدم", value: 0 },
  { label: " کمی اذیت شدم ", value: 1 },
  { label: " خیلی اذیت شدم", value: 2 },
];
const commonForOralBehaviorl = [
  { label: " هیچ وقت ", value: 0 },
  { label: "  به ندرت", value: 1 },
  { label: " بعضی اوقات  ", value: 2 },
  { label: "  بیشتر اوقات ", value: 3},
  { label: " همیشه ", value: 4 },
];
export const questionnaires: Record<string, Questionnaire> = {
  "Pain-assessment": {
    title: "بررسی درد",
    subtitle: "Pain assessment",
    description: " ",
    questions: [
      {
        id: "pa-1",
        type: "radio" as const,
        text: " 	در 30 روز گذشته ، چه مدت در قسمت فک یا شقیقه، در هر طرف صورت، درد داشته اید؟",
        options: [
          { label: "	درد نداشته ام", value: 0 },
          { label: "	گاهی درد داشته ام", value: 1 },
          { label: " دائما درد داشته ام", value: 2 },
        ],
      },
      {
        id: "pa-2",
        type: "radio" as const,
        text: "در 30 روز گذشته ، آیا هنگام بیدار شدن از خواب، درد یا سفت شدگی در قسمت فک داشته اید؟",
        options: [
          { label: "بله", value: 0 },
          { label: "	   خیر", value: 1 },
        ],
      },
      {
        id: "pa-3",
        type: "radio" as const,
        text: "	در30 روز گذشته ، آیا کار های سوالات بعد موجب تغییری در وضعیت درد (مثلا بهتر یا بدتر شدن آن) در محدوده فک یا شقیقه، در هر طرف صورت، شده است ؟",
        options: [],
      },
      ...[
        "جویدن غذای سخت مثل بادام یا غذای سفت مثل گوشتی که خوب پخته نشده",
        "باز کردن دهان یا حرکت فک به جلو یا به طرفین",
        "عادت هایی مانند نگه داشتن دندان ها رویهم ، سائیدن ، دندان قروچه کردن یا آدامس جویدن",
        "سایر فعالیت های فک مانند صحبت کردن ، بوسیدن ، یا خمیازه کشیدن",
      ].map((text, index) => ({
        id: `paa-${index + 1}`,
        type: "radio" as const,
        text,
        options: commonTwoOptions,
      })),
    ],
  },

  "Chronic-Pain-Scale": {
    title: "مقیاس درجه بندی درد مزمن",
    subtitle: "Patient Health Questionnaire",
    description: "",
    questions: [
      {
        id: "pain_opening",
        type: "radio",
        text: "	در 6 ماه گذشته شما چند روز در ناحیه صورت درد داشته اید؟",
        options: [
          { label: "0-5 روز", value: 0 },
          { label: "5-10 روز", value: 1 },
          { label: "10-20 روز", value: 2 },
          { label: "بیشتر از 20 روز", value: 3 },
        ],
      },
      {
        id: "pain_intensity",
        type: "scale",
        text: "	در حال حاضر ، شدت درد صورت تان را چگونه درجه بندی می کنید؟ از مقیاس  0 تا 10 استفاده کنید. (0 = درد وجود ندارد و 10 = بدترین درد ممکن)",
        min: 0,
        max: 10,
        step: 1,
      },
      {
        id: "2",
        type: "scale",
        text: "	در 30 روز گذشته بدترین مقدار دردی که در ناحیه صورت داشته اید را چگونه درجه بندی می کنید؟ از همان مقیاس استفاده کنید. (0 = درد وجود ندارد و 10 = بدترین درد ممکن)",
        min: 0,
        max: 10,
        step: 1,
      },
      {
        id: "3",
        type: "scale",
        text: "	در 30 روز گذشته بطور متوسط درد صورتتان را چگونه درجه بندی می کنید؟ از همان مقیاس استفاده کنید.",
        min: 0,
        max: 10,
        step: 1,
      },
      {
        id: "4",
        type: "radio",
        text: "		در 30روز گذشته، وجود درد صورت، چند روزشما را از فعالیت های معمول مانند کارهای شغلی، رفتن به مدرسه و یا انجام وظایف منزل بازداشته است؟ (عدد 30 = همه روزها)  ",
        options: [
          { label: "0-5 روز", value: 0 },
          { label: "5-10 روز", value: 1 },
          { label: "10-20 روز", value: 2 },
          { label: "  20-30 روز", value: 3 },
        ],
      },
      {
        id: "5",
        type: "scale",
        text: "در 30روز گذشته تا چه اندازه وجود درد صورت فعالیتهای روزمره ی شما را مختل کرده است؟ از مقیاس  0 تا 10 استفاده کنید. (0 = اختلالی ایجاد نکرده و 10 = قادر به انجام فعالیتی نبوده ام)",
        min: 0,
        max: 10,
        step: 1,
      },
      {
        id: "6",
        type: "scale",
        text: "در 30روز گذشته وجود درد صورت تا چه اندازه فعالیتهای تفریحی، اجتماعی و خانوادگی شما را مختل کرده است؟ از همان مقیاس استفاده کنید. ",
        min: 0,
        max: 10,
        step: 1,
      },
      {
        id: "7",
        type: "scale",
        text: "در 30 روز گذشته، وجود درد صورت، تا چه اندازه در توانایی شما در کار کردن (مثل وظایف خانه داری یا انجام شغل خود)، اختلال ایجاد کرده است؟ از همان مقیاس استفاده کنید. ",
        min: 0,
        max: 10,
        step: 1,
      },
    ],
  },

  "Jaw-Functional-Limitation": {
    title: "مقیاس محدودیت عملکردی فک",
    subtitle: "Jaw Functional Limitation Scale",
    description:
      "لطفا برای هر یک از موارد زیر سطح محدودیتی را که در ماه گذشته داشته اید مشخص کنید. چنانچه انجام فعالیتی به دلیل سختی زیاد، برای شما غیر ممکن بوده است، عدد 10 را علامت بگذارید. اگر شما به دلایل دیگری غیر از درد یا سختی فعالیت، از انجام آن پرهیز کرده اید، آن مورد را خالی بگذارید.",
    questions: [
      {
        id: "jfl-1",
        type: "scale",
        text: "	جویدن غذای سفت مثل گوشتی که خوب پخته نشده",
        min: 0,
        max: 10,
        step: 1,
      },
      {
        id: "jfl-2",
        type: "scale",
        text: "	جویدن نان سفت",
        min: 0,
        max: 10,
        step: 1,
      },
      {
        id: "jfl-3",
        type: "scale",
        text: "	جویدن جوجه ( برای مثال جوجه ای که در فر پخته شده)",
        min: 0,
        max: 10,
        step: 1,
      },
      {
        id: "jfl-4",
        type: "scale",
        text: "	جویدن شیرینی خشک یا بیسکویت ترد",
        min: 0,
        max: 10,
        step: 1,
      },
      {
        id: "jfl-5",
        type: "scale",
        text: "	جویدن غذاهای نرم (مثل ماکارونی، کمپوت و یا میوه های نرم، سبزی پخته، ماهی)",
        min: 0,
        max: 10,
        step: 1,
      },
      {
        id: "jfl-6",
        type: "scale",
        text: "	خوردن غذاهای نرم که جویدن نیاز ندارد (مانندسیب زمینی له شده، سس سیب، پودینگ وغذای پوره)",
        min: 0,
        max: 10,
        step: 1,
      },
      {
        id: "jfl-7",
        type: "scale",
        text: "	باز کردن دهان به اندازه کافی برای گاز زدن یک سیب درسته",
        min: 0,
        max: 10,
        step: 1,
      },
      {
        id: "jfl-8",
        type: "scale",
        text: "	باز کردن دهان به اندازه کافی برای گاز زدن یک ساندویچ",
        min: 0,
        max: 10,
        step: 1,
      },
      {
        id: "jfl-9",
        type: "scale",
        text: "	باز کردن دهان به اندازه کافی برای صحبت کردن",
        min: 0,
        max: 10,
        step: 1,
      },
      {
        id: "jfl-10",
        type: "scale",
        text: "	باز کردن دهان به اندازه کافی برای نوشیدن از یک فنجان",
        min: 0,
        max: 10,
        step: 1,
      },
      {
        id: "jfl-11",
        type: "scale",
        text: "بلعیدن",
        min: 0,
        max: 10,
        step: 1,
      },
      {
        id: "jfl-12",
        type: "scale",
        text: "خمیازه کشیدن",
        min: 0,
        max: 10,
        step: 1,
      },
      {
        id: "jfl-13",
        type: "scale",
        text: "صحبت کردن",
        min: 0,
        max: 10,
        step: 1,
      },
      {
        id: "jfl-14",
        type: "scale",
        text: "آواز خواندن",
        min: 0,
        max: 10,
        step: 1,
      },
      {
        id: "jfl-15",
        type: "scale",
        text: "صورت خود را خوشحال نشان دادن",
        min: 0,
        max: 10,
        step: 1,
      },
      {
        id: "jfl-16",
        type: "scale",
        text: "صورت خود را خشمگین نشان دادن",
        min: 0,
        max: 10,
        step: 1,
      },
      {
        id: "jfl-17",
        type: "scale",
        text: "	اخم کردن",
        min: 0,
        max: 10,
        step: 1,
      },
      {
        id: "jfl-18",
        type: "scale",
        text: "بوسیدن",
        min: 0,
        max: 10,
        step: 1,
      },
      {
        id: "jfl-19",
        type: "scale",
        text: "	لبخند زدن",
        min: 0,
        max: 10,
        step: 1,
      },
      {
        id: "jfl-20",
        type: "scale",
        text: "خندیدن",
        min: 0,
        max: 10,
        step: 1,
      },
    ],
  },

  "Patient-health": {
    title: "پرسشنامه سلامت بیمار",
    subtitle: "Patient Health Questionnaire",
    description:
      "در  2هفته گذشته، چه مدت تحت تاثیر مشکلات زیر اذیت شده اید؟ لطفا با علامت گذاری داخل مربع مربوطه به سؤال پاسخ دهید",
    questions: [
      "	علاقه یا اشتیاق کم برای انجام کارها",
      "احساس ناراحتی، افسردگی، یا ناامیدی",
      "	مشکل در به خواب رفتن یا از خواب پریدن، یا زیاد خوابیدن",
      "	احساس خستگی یا کم‌انرژی بودن",
      "کم‌اشتهایی یا پرخوری",
      "	احساس بد درباره خود یا احساس اینکه شما یک بازنده هستید یا خود یا خانواده‌تان را نا امید کرده اید.",
      "	مشکل در تمرکز کردن، مثلا به هنگام خواندن روزنامه و یا تماشای تلویزیون",
      "	حرکات شما و یا صحبت کردن تان آنقدر کند بوده، بطوریکه دیگران متوجه این حالت شده‌اند؟ یا بالعکس، بیقرار بوده اید و دائما تحرک غیرعادی داشته‌اید و بی‌علت جابجا می‌شدید.",
      "	فکرکردن به اینکه بهتر بود بمیرید و یا به طریقی به خودتان صدمه وارد کنید.",
    ].map((text, index) => ({
      id: `ph_${index + 1}`,
      type: "radio" as const,
      text,
      options: commonForPatienthealth,
    })),
  },
  "Generalized-anxiety": {
    title: "اختلال اضطراب عمومی",
    subtitle: "Generalized anxiety disorder",
    description:
      "در  2هفته گذشته، چه مدت تحت تاثیر مشکلات زیر اذیت شده اید؟ لطفا با علامت گذاری داخل مربع مربوطه به سؤال پاسخ دهید",
    questions: [
      "احساس عصبی بودن، اضطراب یا زودرنجی",
      "	قادر به رفع نگرانی و یا کنترل آن نبوده اید",
      "	نگرانی خیلی زیاد درباره ی چیزهای مختلف",
      "	مشکل آرام شدن",
      "	آنقدر بیقراری داشته‌اید که بی‌حرکت نشستن برایتان سخت بود",
      "	به سادگی دلخور می شدید یا زود رنج بودید",
      "	احساس ترس از اینکه ممکن است اتفاق بدی پیش بیاید",
    ].map((text, index) => ({
      id: `ph_${index + 1}`,
      type: "radio" as const,
      text,
      options: commonForPatienthealth,
    })),
  },
  "Patient-Health-Physical": {
    title: "پرسشنامه سلامت بیمار با نشانه‌های فیزیکی",
    subtitle: "Patient Health Questionnaire",
    description:
      "در 4 هفته گذشته تا چه اندازه تحت تاثیر هر یک از مشکلات زیر اذیت شده اید؟ لطفا با علامت گذاری داخل مربع مربوطه به سؤال پاسخ دهید",
    questions: [
      "	درد شکم",
      "درد پشت",
      "درد در بازوها، ساق ها یا مفاصل (زانوها، ران ها و غیره)",
      "گرفتگی عضلانی یا سایر ناراحتی ها در دوره قاعدگی (زنان)",
      "سردردها",
      "درد سینه",
      "	سرگیجه",
      "حملات غش",
      "احساس تند زدن یا به سختی زدن قلب",
      "نفس کم آوردن",
      "درد یا مشکل داشتنن به هنگام نزدیکی",
      "	یبوست، شل مزاجی یا اسهال",
      "	تهوع، تولید گاز ، سوء هاضمه",
      "احساس خستگی یا کم انرژی بودن",
      "	مشکل خواب",
    ].map((text, index) => ({
      id: `phq15_${index + 1}`,
      type: "radio" as const,
      text,
      options: commonForPatienthealthPhysical,
    })),
  },
  "Oral-Behavior": {
    title: "چک‌ لیست رفتار دهان و دندان",
    subtitle: "Oral Behavior Checklist",
    description:
      "در ماه گذشته، هر کدام از فعالیت های زیر را چند بار انجام داده اید؟ چنانچه تناوب فعالیت متغیر بوده است، لطفا بیشترین تعداد را انتخاب کنید. لطفا هر بخش را با گذاشتن علامت پاسخ دهید و از هیچ بخشی بدون پاسخ رد نشوید. ",
    questions: [
      {
        id: "ob-1",
        type: "radio" as const,
        text: "فشردن یا سائیدن دندان ها بهم حین خواب، بر اساس هر اطلاعاتی که دارید. (مثلا گزارش فردی که شما را حین خواب می بیند)",
        options: [
          { label: "هیچ‌ وقت", value: 0 },
          { label: " کمتر از 1شب در ماه", value: 1 },
          { label: " 1-3 شب در ماه", value: 2 },
          { label: " 1-3 شب در هفته ", value: 3 },
          { label: "4-7 شب در هفته", value: 4 },
        ],
      },
      {
        id: "ob-2",
        type: "radio" as const,
        text: "به گونه‌ای می‌خوابیدید که روی فک شما فشار وارد می‌شده است (مثلا روی شکم و یا به پهلو خوابیدن)",
        options: [
          { label: "هیچ‌ وقت", value: 0 },
          { label: " کمتر از 1شب در ماه", value: 1 },
          { label: " 1-3 شب در ماه", value: 2 },
          { label: " 1-3 شب در هفته ", value: 3 },
          { label: "4-7 شب در هفته", value: 4 },
        ],
      },
      ...[
        "	سائیدن دندان ها روی هم در ساعات بیداری",
        "	فشردن دندان ها بر هم در ساعات بیداری",
        "	فشردن، لمس کردن یا روی هم نگهداشتن دندان ها در مواقعی که غذا نمی خورید (تماس بین دندان های بالا و پایین)",
        "	بدون فشردن یا نگه داشتن دندان ها روی هم، ماهیچه ها را در حالت فشرده یا سفت و یا تحت کشش نگه می داشتید.",
        "فک را به جلو یا به یک طرف برده یا در چنین حالتی نگه می داشتید",
        "	زبان را محکم به دندان‌ها بفشارید",
        "	زبان را بین دندان‌ها قرار داده باشید",
        "زبان، لب یا لُپ‌هایتان را بگزید ، بجوید یا با آن بازی کنید",
        "	فک را در وضعیت سفت یا فشرده نگه می داشتید. مثل حالتی که فک از بیرون با وسیله کمکی محافظت می‌شود.",
        "اشیایی مانند مو، نی، مداد، خودکار، انگشتان، ناخن ها و غیره را گاز بزنید یا بین دندان‌ها نگه می‌داشتید",
        "از آدامس استفاده کرده باشید",
        "نواختن وسیله موسیقی که نیاز به استفاده از دهان یا فک دارد ( مانند سازهای بادی، بادی برنجی و زهی)",
        "تکیه‌دادن فک روی دست مثل حالتی که دست به صورت فنجانی زیر چانه قرار گرفته یا استراحت چانه روی دست",
        "	فقط با یک طرف دهان غذا جویده باشید",
        "	بین وعده های غذایی، غذا خورده باشید (برای مثال غذایی که نیاز به جویدن دارد)",
        "صحبت‌کردن طولانی (برای مثال تدریس، فروشندگی یا سرویس دادن به مشتریان)",
        "	آواز خواندن",
        "	خمیازه کشیدن",
        "تلفن را بین سر و شانه نگه داشته باشید",
      ].map((text, index) => ({
        id: `ob2-${index + 1}`,
        type: "radio" as const,
        text,
        options: commonForOralBehaviorl,
      })),
    ],
  },
};
